app/Controllers/Admin.php

    public function index()
    {
        if (! session()->get('isLoggedIn') || session()->get('role') !== 'admin') {
            return redirect()->to('/login');
        }

        $model = new \App\Models\RestaurantModel();
        $data['restaurants'] = $model->findAll();
---
SELECT *
FROM `restaurants`

    public function save()
    {
        helper(['form', 'url']);

        // validacija (opciono: dodaj pravila za image)
        $validation = \Config\Services::validation();
        $validation->setRules([
            'name'     => 'required',
            'cuisine'  => 'required',
            'capacity' => 'required|integer',
            'image'    => 'uploaded[image]|max_size[image,2048]|is_image[image]',
        ]);

        if (! $this->validate($validation->getRules())) {
            return redirect()->back()
                            ->withInput()
                            ->with('errors', $validation->getErrors());
        }

        // obrada fajla
        $img = $this->request->getFile('image');
        $newName = $img->getRandomName();
        $img->move(ROOTPATH . 'public/uploads', $newName);

        // insert u bazu
        $model = new \App\Models\RestaurantModel();
        $model->insert([
            'name'      => $this->request->getPost('name'),
            'cuisine'   => $this->request->getPost('cuisine'),
            'capacity'  => (int)$this->request->getPost('capacity'),
            'available' => (int)$this->request->getPost('capacity'),
            'image'     => $newName,
        ]);
---
INSERT INTO `restaurants` (`name`, `cuisine`, `capacity`, `available`, `image`) VALUES ('Kole', 'Tradicionalna', 150, 150, '1747486133_743b00f2e7b0234096f4.jpeg')