app/Controllers/AdminMenus.php

    public function index()
    {
        $restaurants = (new RestaurantModel())->findAll();
---
SELECT *
FROM `restaurants`

    public function show(int $restId)
    {
        $items = (new MenuModel())
            ->where('restaurant_id', $restId)
            ->orderBy('category','ASC')
            ->orderBy('item_name','ASC')
            ->findAll();

        $grouped = [];
        foreach ($items as $i) {
            $grouped[$i['category']][] = $i;
        }

        return view('admin/menus/show', [
            'restaurant' => (new RestaurantModel())->find($restId),
            'grouped'    => $grouped,
        ]);
---
SELECT *
FROM `menus`
WHERE `restaurant_id` = 19
ORDER BY `category` ASC, `item_name` ASC
SELECT *
FROM `restaurants`
WHERE `restaurants`.`id` = 19