app/Controllers/Dashboard.php

    public function reservations()
    {
        if (! session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $reservations = (new ReservationModel())
            ->select('reservations.id, restaurants.name AS restaurant_name, reservations.people, reservations.meal_type, reservations.reservation_time')
            ->join('restaurants', 'restaurants.id = reservations.restaurant_id')
            ->where('reservations.user_id', session()->get('user_id'))
            ->orderBy('reservations.reservation_date', 'DESC')
            ->findAll();
---
SELECT `reservations`.`id`, `restaurants`.`name` AS `restaurant_name`, `reservations`.`people`, `reservations`.`meal_type`, `reservations`.`reservation_time`
FROM `reservations`
JOIN `restaurants` ON `restaurants`.`id` = `reservations`.`restaurant_id`
WHERE `reservations`.`user_id` = '4'
ORDER BY `reservations`.`reservation_date` DESC

    public function menus()
    {
        if (! session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $username = session()->get('username');

        $restaurants = (new RestaurantModel())->findAll();
        $mModel      = new MenuModel();

        $menusByRestaurant = [];
        foreach ($restaurants as $rest) {
            $menusByRestaurant[] = [
                'restaurant' => $rest,
                'items'      => $mModel
                    ->where('restaurant_id', $rest['id'])
                    ->orderBy('item_name', 'ASC')
                    ->findAll(),
            ];
---
SELECT *
FROM `menus`
WHERE `restaurant_id` = '6'
ORDER BY `item_name` ASC