app/Controllers/Dashboard.php

SELECT *
FROM `restaurants`
ORDER BY `created_at` DESC
 LIMIT 3
---
    public function index()
    {
        if (! session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        // Prikaz preporučenih (npr. najnovijih) 3 restorana
        $recommended = (new RestaurantModel())
            ->orderBy('created_at', 'DESC')
            ->findAll(3);

        return view('dashboard', [
            'username'    => session()->get('username'),
            'role'        => session()->get('role'),
            'restaurants' => $recommended,
        ]);

SELECT *
FROM `restaurants`
---
    public function restaurants()
    {
        if (! session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        return view('restaurants/list', [
            'restaurants' => (new RestaurantModel())->findAll(),
            'role'        => session()->get('role'),
        ]);

SELECT *
FROM `restaurants`
WHERE `restaurants`.`id` = 17
---
    public function reserve(int $id)
    {
        if (! session()->get('isLoggedIn')) {
            return redirect()->to('/login')->with('error', 'Morate se prijaviti.');
        }

        $userId = session()->get('user_id');
        $resModel = new \App\Models\ReservationModel();

        // 1) Proveri da li već postoji rezervacija
        $already = $resModel
            ->where('user_id', $userId)
            ->where('restaurant_id', $id)
            ->first();
        if ($already) {
            return redirect()->back()
                            ->with('error', 'Već ste rezervisali ovaj restoran.');
        }

        // 2) Preuzmi restoran i proveri dostupnost
        $restModel = new \App\Models\RestaurantModel();
        $rest      = $restModel->find($id);

SELECT *
FROM `reservations`
WHERE `user_id` = '3'
AND `restaurant_id` = 17
 LIMIT 1
---
    public function checkReservation(int $restaurantId)
    {
        if (! session()->get('isLoggedIn')) {
            return $this->response->setStatusCode(401);
        }

        $userId = session()->get('user_id');
        $rModel = new \App\Models\ReservationModel();

        $exists = $rModel
            ->where('user_id', $userId)
            ->where('restaurant_id', $restaurantId)
            ->first() !== null;

SELECT `reservations`.`id`, `restaurants`.`name` AS `restaurant_name`
FROM `reservations`
JOIN `restaurants` ON `restaurants`.`id` = `reservations`.`restaurant_id`
WHERE `reservations`.`user_id` = '3'
ORDER BY `reservations`.`reservation_date` DESC
---
    public function reservations()
    {
        if (! session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $data['reservations'] = (new ReservationModel())
            ->select('reservations.id, restaurants.name AS restaurant_name')
            ->join('restaurants', 'restaurants.id = reservations.restaurant_id')
            ->where('reservations.user_id', session()->get('user_id'))
            ->orderBy('reservations.reservation_date', 'DESC')
            ->findAll();

SELECT *
FROM `reservations`
WHERE `reservations`.`id` = 16
SELECT *
FROM `restaurants`
WHERE `restaurants`.`id` = '12'
UPDATE `restaurants` SET `available` = 50
WHERE `restaurants`.`id` IN ('12')
DELETE FROM `reservations`
WHERE `id` IN (16)
---
    public function cancel(int $id)
    {
        if (! session()->get('isLoggedIn')) {
            return redirect()->to('/login')->with('error', 'Morate se prijaviti.');
        }

        $userId = session()->get('user_id');
        $rModel  = new ReservationModel();
        $res     = $rModel->find($id);

        if (! $res || $res['user_id'] !== $userId) {
            return redirect()->to('/reservations')
                             ->with('error', 'Ne možete otkazati ovu rezervaciju.');
        }

        // Vrati mesto u restoran
        $restModel  = new RestaurantModel();
        $restaurant = $restModel->find($res['restaurant_id']);
        if ($restaurant) {
            $restModel->update($restaurant['id'], [
                'available' => $restaurant['available'] + 1,
            ]);
        }

        // Obriši rezervaciju
        $rModel->delete($id);

SELECT *
FROM `restaurants`
SELECT *
FROM `menus`
WHERE `restaurant_id` = '6'
ORDER BY `item_name` ASC
---
    public function menus()
    {
        if (! session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $username = session()->get('username');

        $restaurants = (new RestaurantModel())->findAll();
        $mModel      = new MenuModel();

        $menusByRestaurant = [];
        foreach ($restaurants as $rest) {
            $menusByRestaurant[] = [
                'restaurant' => $rest,
                'items'      => $mModel
                    ->where('restaurant_id', $rest['id'])
                    ->orderBy('item_name', 'ASC')
                    ->findAll(),